/**
 ******************************************************************************
 * @file    task_baseInit
 * @author  小柔
 * @date    2025-1-13
 * @brief   基础初始化
 *****************************************************************************/

#include "common.h"

/* 基础驱动初始化 */
void task_baseInit(void)
{
    _INIT; /* 初次进入任务时，执行一次 */

    sys_wait(100);

    sys_goto(task_demo);

    _FREE; /* 任务结束，不再执行时，释放资源 */

    _RUN; /* 下方开始进入任务运行逻辑 */
}

/************************** END OF FILE **************************/
