/**
 ******************************************************************************
 * @file    task_baseInit
 * @author  sloop
 * @date    2025-1-13
 * @brief   基础初始化
 *****************************************************************************/

#include "common.h"

/* 基础驱动初始化 */
void task_baseInit(void)
{
    /* 初次进入任务时，执行一次 */
    _INIT;

    sl_goto(task_flow);

    /* 任务结束，不再执行时，释放资源 */
    _FREE;

    /* 下方开始进入任务运行逻辑 */
    _RUN;
}

/************************** END OF FILE **************************/
